[
    ["1.", "The Open API Trader application (“the Application”) is a mobile trader connected to the cTrader Open API protocol. It was developed by Finansoft s.r.o. (the “Publisher”), a company registered in the Czech Republic, with the use of source code provided by Spotware Ltd, the owner of the cTrader brand (the “Source Code Provider”)."],
    ["2.", "For the purposes of these terms and conditions, the terms “end user”, ”user” or any reference to You as the user means any individual or entity that interacts with or uses the Application in any way, regardless of their specific role, purpose or level of engagement. This includes, but is not limited to, customers, clients, employees, traders, administrators, partners, brokers or any other person or organisation that accesses, navigates or uses the features and functionalities provided by the Application."],
    ["3.", "The Publisher and the Source Code Provider are intermediary technology platforms that offer the Application for the use of end users. The Publisher and the Source Code Provider are not brokers themselves and, therefore, do not have any responsibility for any losses that may occur as a result of using the Application."],
    ["4.", "The Application is used at your own risk, and under no circumstances can the Publisher and the Source Code Provider be held liable for any losses that may occur while using the Application."],
    ["5.", "The Publisher only allows the use of demo accounts in order to prevent the risks of live trading. Nevertheless, the Publisher and the Source Code Provider are not responsible for any negative experience, including, but not limited to, financial losses. If you do not accept these conditions, please do not use the Application."],
    ["6.", "The Publisher and the Source Code Provider do not take responsibility for any bugs, inconsistencies or other technical issues that may arise during the use of the Application. "],
    ["7.", "The Application relies on various third-party services, including market quotes, which are not under the control of the Publisher and the Source Code Provider but can affect the expected behavior of the Application. Therefore, the Publisher and the Source Code Provider cannot be held liable for any actions or omissions of these third-party services."],
    ["8.", "In general, the Publisher and the Source Code Provider cannot be held liable for any losses that may result from the use of the Application. You, as the user, are responsible for any potential losses incurred while using the Application."],
    ["9.", "The Application should not be considered to be a supply of financial or investment advice. Any trading decisions based on information obtained from the Application are made at your own risk, and the Publisher and the Source Code Provider cannot be held responsible for any resulting trading losses."],
    ["10.", "The Publisher and the Source Code Provider do not guarantee the accuracy, completeness or reliability of any market quotes, data or information provided through the Application. Any reliance on such information is done at your own discretion, and the Publisher and the Source Code Provider cannot be held liable for any trading losses resulting from inaccurate or unreliable information."],
    ["11.", "In no event shall the Publisher and the Source Code Provider be liable to you or to any third party for any direct, indirect, incidental, special or consequential damages, including, but not limited, to trading losses, arising out of or in connection with the use of the Application."],
    ["12.", "The Application may provide access to third-party services. The Publisher and the Source Code Provider are not responsible for the actions, services or products of these third parties, and any trading losses incurred as a result of using these third-party services are not the responsibility of the Publisher and the Source Code Provider."],
    ["13.", "The Publisher and the Source Code Provider shall not be liable for any direct, indirect, incidental, consequential or special damages arising out of or in connection with the use of the Application. This includes, but is not limited to, any loss of data, loss of profits or interruption of business."],
    ["14.", "The Publisher and the Source Code Provider shall not be liable for any direct, indirect, incidental, consequential or special damages arising out of or in connection with the use of the cTrader Open API solution. This includes, but is not limited to, any loss of data, loss of profits or interruption of business."],
    ["15.", "You agree to indemnify and to hold harmless the Publisher and the Source Code Provider, its affiliates and their respective directors, officers, employees and agents from any claims, damages, losses, liabilities, costs or expenses (including reasonable legal fees) arising out of or related to your use of the Application, including any violation of these terms."],
    ["16.", "The Publisher and the Source Code Provider will make reasonable efforts to ensure the availability and reliability of the Application. However, the Publisher and the Source Code Provider do not guarantee uninterrupted or error-free and bug-free access to the Application. You acknowledge that there may be occasional disruptions, downtime or technical issues, and you agree that the Publisher and the Source Code Provider shall not be held responsible for any such interruptions."],
    ["17.", "The Source Code Provider retains all rights, title and interest in and to the Application, including any intellectual property rights. "]
]