[
    ["1.", "Trading4Pro Services including Market Trends, Trading Room, Forex Heatmaps, Charts, Algo Trends and Back Testing Charts (hereunder The \"Finansoft Products\"), provided through www.trading4pro.com website, www.watchthecoin.com website, Trading4Pro mobile applications, platforms or through Trading4Pro web widgets (\"Services\") are owned by Finansoft S.R.O. a company incorporated under the laws of the Czech Republic (\"Finansoft\")."],
    ["2.", "Definitions:"],
        ["a.", "\"Market Trends\" - shall mean Finansoft’s technical analysis tool, that is automatically analysing popular indicators of technical analysis behaviour (e.g. EMA, RSI and Stochastic) and provides a score to each indicator’s behaviour on a 5 grades scale – \"Strong Sell\", \"Sell\", \"Neutral\", \"Buy\", \"Strong Buy\" for different financial instruments, per different timeframes;"],
        ["b.", "\"Trading Room\" - shall mean live-updated feed of trading ideas, that are presented in details on live chart (whether on Finansoft \"Chart\" or any 3rd party candlestick charting software). Trading ideas are based on theory of technical analysis and suggest personal opinion on future movement of the market/specific asset. Trade’s projected direction, duration, publisher’s confidence and basic explanation are added to each trading idea;"],
        ["c.", "\"Charts\" - shall mean any Charts provided on Trading4Pro websites, mobile applications and platform or through widgets embedded on 3rd party resources including (i) Real-time stock Charts; (ii) Multi-Platform Real-Time stock Charts; (iii) Real-time interactive stock Charts; (iv) Real-time Mobile stock Charts; (v) On-Chart data; (vi) Back Testing Charts;"],
        ["d.", "\"Forex Heatmaps\" – shall mean Finansoft’s analysis tool, that is simultaneously calculating different financial instruments change in-% per different timeframes. Every % value is related to 7 grades color scale for quicker differentiation;"],
        ["e.", "\"Algo Trends\" – shall mean a tool, based on Finansoft's Market Trends tool, this demo tool allows user to customize parameters of all indicators existing in Market Trends tool, to add \"take profit\" and \"stop loss\" levels and to track customized algorithm efficiency in terms of profitability. Algo Trend tool will provide 2 types of signals: (1) [opening signal] – when all the parameters as defined by user are matched; (2) [closing signal] - when opening signal reaches \"take profit\" or \"stop loss\" level as defined by user;"],
        ["f.", "\"Back Testing Chart\" – shall mean a tool that presents on chart demonstration of algorithm based on user's customized parameters tested on historic financial data (candlestick data); To avoid any doubt, this tool simulates historic data and cannot be accurate compared to real time analysis."],
    ["3.", "By using our Services, you are agreeing to these terms, if you disagree with our terms, please stop using our services."],
    ["4.", "You read and approve Finansoft Investment Warning and Disclaimer notice and Finansoft Privacy Policy."],
    ["5.", "Finansoft, at any time, may modify the Terms of Use, the Investment Warning and Disclaimer notice and the Privacy Policy, so you should look at the terms regularly."],
    ["6.", "Finansoft may limit or otherwise restrict access to any of its Services at any time; Finansoft may provide limited version of its Services; Finansoft may require any user to meet commercial terms in order to allow access to its Services; Finansoft may restrict the usage of its Services in any territory;"],
    ["7.", "When you use Trading4Pro Services you commit to the following:"],
        ["a.", "Finansoft owns and shall retain all rights, including Intellectual Property Rights, in and to the Finansoft Products;"],
        ["b.", "You shall not copy, reproduce, market, sell, distribute, modify, disassemble, create derivative works or otherwise reverse engineer any of Finansoft Services, system, web widgets, Market Trends, Trading Room, Forex Heatmaps, Charts, Algo Trends and Back Testing Charts;"],
        ["c.", "You shall not modify or transfer to third party the web widget provided by Trading4Pro;"],
        ["d.", "You agree to defend, indemnify and hold Finansoft and its officers, directors, employees and assignees, from and against any third party liability, claims, loss, damage, injury or expense, excluding attorney's fees, arising out of a breach of any of your commitments;"],
        ["e.", "To use Trading4Pro Services fairly and not interfere with their operation;"],
        ["f.", "To use the Services according to any applicable law, including applicable stock exchange, trading, investment, export and re-export control laws and regulations;"],
        ["g.", "You shall not provide or link to any content containing (1) any illegal content or content that violates third party rights; (2) pornography or nudity (3) malicious code or viruses; (4) defamatory or content that contains any hate, threats or discriminatory remarks;; (5) any offensive language or remarks; (6) any personal identified information; (7) political issues not directly related to your Trading Ideas; (8) any SPAM or previously published Trading Ideas; and (9) unverified rumors or facts you cannot verify;"],
        ["h.", "You acknowledge Finansoft right to charge for, limit, restrict or fully terminate your access to Trading4Pro Services, at any time, with or without a warning."],
        ["i.", "When using Algo Trends tool, you understand and agree that the output of the usage of the Algo Trends tool or any other Finansoft services including any algorithms and any Charts are the sole property of Finansoft and all commercial, intellectual property rights, intellectual property moral rights or other rights for the output of any of Finansoft's services including all created algorithms is undisputed property of Finansoft and not yours. You won’t claim any rights or benefits from Finansoft regarding any output of the Finansoft's services; Finansoft has right to use any of the above intellectual property to create future tools, e.g. social/mirror demo or real trading tools or services."],
    ["8.", "When you upload, post, store, publish or share Market Trends, Trading Room, Forex Heatmaps, Charts, Algo Trends and Back Testing Charts, you also commit to the following:"],
        ["a.", "Not to interfere, alter, change, cover any data displayed through Finansoft Services;"],
        ["b.", "To allow the display and links to Finansoft's Investment Warning and Disclaimer as displayed by Finansoft on the Market Trends, Trading Room, Forex Heatmaps, Charts, Algo Trends and Back Testing Charts display;"],
        ["c.", "You shall not remove, hide, cover or change any of the data received using the web widget or any other information derived from Trading4Pro platform, applications, Market Trends, Trading Room, Forex Heatmaps, Charts, Algo Trends and Back Testing Charts."],
    ["9.", "When you upload, post, store, publish or share any of your Trading Ideas, Charts, Algo Trends algorithms or Back Testing Charts through our Services you also commit to the following:"],
        ["a.", "The content will be your Personal content or based on parameters you provided to the system or your personal Trading Ideas as defined above;"],
        ["b.", "You shall not, knowingly, provide inaccurate facts or data through Trading4Pro Services;"],
        ["c.", "You post your Trading Ideas, Charts, Algo Trends algorithms or Back Testing Charts with reasonable care and cautious;"],
        ["d.", "To use the Services according to any applicable law, including applicable stock exchange, trading, investment, export and re-export control laws and regulations;"],
        ["e.", "You agree that any Trading Ideas (included and excluded in Trading Room), Charts, Algo Trends, Back Testing Charts or other data you post on Trading4Pro through its Services is yours or that you obtained permission from its owner to post the Trading Ideas, Chart, Algo Trends, Back Testing Chart or data or it is otherwise permitted by law to post such Trading Ideas, Charts, Algo Trends, Back Testing Chart or data. Although we may, don't assume Finansoft reviewed any of your or others' Trading Ideas;"],
        ["f.", "You shall not provide or link to any content containing (1) any illegal content or content that violates third party rights; (2) pornography or nudity (3) malicious code or viruses; (4) defamatory or content that contains any hate, threats or discriminatory remarks; (5) any offensive language or remarks; (6) any personal identified information; (7) political issues not directly related to your Trading Ideas; (8) any SPAM or previously published Trading Ideas; and (9) unverified rumors or facts you cannot verify."],
    ["10.", "You agree to defend, indemnify and hold Finansoft and its officers, directors, employees, agents, successors and assignees, from and against any and all liability, claims, loss, damage, injury or expense arising out of a breach of any of your above mentioned obligations and commitments or with respect to any Trading Ideas, Market Trends, Algo Trends, Charts or Back Testing Chart you posted or otherwise shared through Trading4Pro Services."],
    ["11.", "Governing Law: Any and all disputes concerning your usage in the Trading4Pro Services, platform, application or website shall be submitted solely to the jurisdiction of applicable court in the Czech Republic, pursuant to the laws of the Czech Republic."]
]